/*
Основное:
Представим, что в Java нет коллекции типа ArrayList.
Создать свой класс, симулирующий работу класса динамической
коллекции - т.е. создать свою кастомную коллекцию.
В основе коллекции будет массив.
Кастомная коллекция должна хранить элементы разных классов(т.е. это
generic).
Предусмотреть операции добавления элемента, удаления элемента,
получение элемента по индексу, проверка есть ли элемент в коллекции,
метод очистки все коллекции.
Предусмотреть конструктор без параметров - создает массив размером
по умолчанию.
Предусмотреть конструктор с задаваемым размером внутреннего
массива.
Предусмотреть возможность автоматического расширения коллекции при
добавлении элемента в том случае, когда коллекция уже заполнена.

Доп:
Есть массив целых чисел, в котором числа могут повторяться:
1) Не используя коллекции (или map) найти число, которое повторяется большее число раз;
2) Решить эту же задачу используя любые структуры данных.
*/

package org.tms.collections;

public class MainApp {
    public static void main(String[] args) {

        // создание экземпляра коллекции, содержащей массив на 5 элементов (значение по умолчанию)
        CustomCollection<String> array = new CustomCollectionImpl<>();

        // заполнение коллекции новыми элементами
        array.add("Василевский");
        array.add("Павлов");
        array.add("Константинов");
        array.add("Григорьев");
        array.add("Березняков");
        array.add("Корж");
        array.add("Кожухов");
        System.out.println(array);

        // удаление первого элемента коллекции и вывод на консоль измененной коллекции
        array.remove(1);
        System.out.println(array);

        // вывод на консоль элемента коллекции, находящегося по индексу 5
        String byIndex = array.getByIndex(5);
        System.out.println(byIndex);

        // вывод результата поиска элемента, хранимого в коллекции
        String wasFound = "Корж";
        System.out.println(array.checkForAvailability(wasFound)
                ? "Элемент '" + wasFound + "' есть в коллекции."
                : "Элемент '" + wasFound + "' не был найден.");

        // очистка содержимого, хранимого в коллекции
        array.clear();
    }
}