/*
Напишите программу, которая будет принимать на вход число и на
выход будет выводить сообщение четное число или нет.
Для определения четности числа используйте операцию получения
остатка от деления - операция выглядит так: '% 2').
*/

import java.util.Scanner;

public class ControlStructures3 {
    public static void main(String[] args) {

        // вывод сообщения на консоль о просьбе ввода числа для проверки на четность
        System.out.print("Введите число: ");

        // инициализация переменной для ввода целочисленного значения с клавиатуры
        Scanner scanner = new Scanner(System.in);
        int number = scanner.nextInt();

        // определение четности введенного числа
        if (number % 2 == 0) System.out.print("Число является четным.");
        else System.out.print("Число является нечетным.");
    }
}