/*
Напишите программу, где пользователь вводит любое целое
положительное число. А программа суммирует все числа от 1 до
введенного пользователем числа.
Для ввода числа воспользуйтесь классом Scanner.
*/

import java.util.Scanner;

public class Cycles3 {
    public static void main(String[] args) {

        // инициализация переменной с отрицательным значением для ввода пользователем числа, соответствующего условию задачи
        int positiveNumber = -1;

        // инициализация переменной для вывода результата на консоль
        int result = 0;

        // инициализация переменной для считывания символов с клавиатуры
        Scanner scanner = new Scanner(System.in);

        // проверка введенного числа на положительность
        while (positiveNumber < 0)
        {
            // вывод сообщения на консоль о просьбе ввода положительного числа
            System.out.print("Введите любое положительное целое число: ");

            // инициализация переменной для ввода целочисленного значения с клавиатуры
            positiveNumber = scanner.nextInt();
        }

        // цикл суммирования всех чисел от 1 до введенного пользователем числа
        for (int i = 1; i <= positiveNumber; i++)
            result += i;

        System.out.print("Ответ: " + result);
    }
}